uhnp/src/Documents/тн_НачислениеРезерваПодОбесценениеТМЦ/тн_НачислениеРезерваПодОбесценениеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>тн_НачислениеРезерваПодОбесценениеТМЦ</name>
  <comment>Выполнение задач №000050794</comment>
  <registerRecords>AccumulationRegister.тн_РезервыПодОбесценениеТМЦ</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовДляНачисленияРезерва</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовДляВосстановленияРезерва</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяАктиваПассиваДляОтраженияРезерва</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыНоменклатурыОтборЗначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыОтборВидСравнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыОтборИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расчет</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериодаАнализаНеликвидности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстатковНаКонецПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОстатковНаКонецПериодаРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОстатковНаКонецПериодаУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЗаЕдиницуРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЗаЕдиницуУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПриходЗаПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОборачиваемостьПоКоличеству</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРезерваКНачислению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерваКНачислениюРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерваКНачислениюУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРанееНачисленногоРезерва</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРанееНачисленногоРезерваРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРанееНачисленногоРезерваУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРезерваКНачислению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерваКНачислениюРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерваКНачислениюУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРанееНачисленногоРезерва</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРанееНачисленногоРезерваРегл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРанееНачисленногоРезерваУпр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/тн_ПараметрыРасчетаРезерваПодОбесценениеТМЦ/тн_ПараметрыРасчетаРезерваПодОбесценениеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ПараметрыРасчетаРезерваПодОбесценениеТМЦ</name>
  <comment>Выполнение задач №000050794</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентДляРезерва</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыпускПродукции</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АналитикаУчетаПродукции</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.МаршрутныйЛистПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказМатериаловВПроизводство</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.ЗаказПереработчику2_5</types>
      <types>DocumentRef.ЗаказДавальца2_5</types>
      <types>DocumentRef.ЗаказНаРемонт</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/AccumulationRegisters/тн_РезервыПодОбесценениеТМЦ/тн_РезервыПодОбесценениеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>тн_РезервыПодОбесценениеТМЦ</name>
  <comment>Выполнение задач №000050794</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРезерваРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРезерваУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <comment>Выполнение задач №000053206</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <comment>Выполнение задач №000053111</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Documents/тн_НачислениеРезерваПодОбесценениеТМЦ/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		Объект.Ответственный = ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь");
		
	КонецЕсли;       
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ЗаполнитьДопКолонкиПоНоменклатуреВТабличныхЧастях();
	ВосстановитьВидыНоменклатурыОтбор();

	НастроитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьДопКолонкиПоНоменклатуреВТабличныхЧастях();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыОтборИспользованиеПриИзменении(Элемент)
	НастроитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатурыПриИзменении(Элемент)
	
	СохранитьВидыНоменклатурыОтбор();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура РасчетНоменклатураПриИзменении(Элемент)
	ЗаполнитьДопКолонкиПоНоменклатуре("Расчет", Элементы.Расчет.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура НачислениеНоменклатураПриИзменении(Элемент)
	ЗаполнитьДопКолонкиПоНоменклатуре("Начисление", Элементы.Расчет.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура СписаниеНоменклатураПриИзменении(Элемент)
	ЗаполнитьДопКолонкиПоНоменклатуре("Списание", Элементы.Расчет.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(,"Не заполнена Организация");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ПоказатьПредупреждение(,"Не заполнена Подразделение");
		Возврат;
	КонецЕсли;
	
	ТаблицыЗаполнены = Объект.Расчет.Количество() > 0 Или Объект.Начисление.Количество() > 0 Или Объект.Списание.Количество() > 0;
	Если ТаблицыЗаполнены Тогда
		
		Обещание = ВопросАсинх("Существующие строки всех таблиц будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Ответ = Ждать Обещание;
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьИзExcel(Команда)
	
	ТаблицыЗаполнены = Объект.Расчет.Количество() > 0 Или Объект.Начисление.Количество() > 0 Или Объект.Списание.Количество() > 0;
	Если ТаблицыЗаполнены Тогда
		
		Обещание = ВопросАсинх("Существующие строки всех таблиц будут удалены. Продолжить?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Ответ = Ждать Обещание;
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	//Открываем форму чтения файла Excel
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидНоменклатурыОтборИспользование", Объект.ВидНоменклатурыОтборИспользование);
	ПараметрыФормы.Вставить("ВидНоменклатурыОтборВидСравнения", Объект.ВидНоменклатурыОтборВидСравнения);
	ПараметрыФормы.Вставить("ВидыНоменклатурыОтборЗначение", ВидыНоменклатурыОтборЗначение);
	
	Оповещение = Новый ОписаниеОповещения("Ответ_ЗагрузитьИзExcel", ЭтотОбъект);
	ОткрытьФорму("Документ.тн_НачислениеРезерваПодОбесценениеТМЦ.Форма.ФормаЗагрузкаИзExcel", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВНачисленияСписания(Команда)
	
	//тч Начисление
	ПеренестиНачисленияИзРасчета();
	
	//тч Списание
	ПеренестиСписанияИзРасчета();
	
КонецПроцедуры
 
// Борисенко Игорь 20.03.2025 Выполнение задач №000053111
&НаКлиенте
Процедура ЗаполнитьРанееНачисленныеРезервы(Команда)
	ЗаполнитьРанееНачисленныеРезервыСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуНаСервере()

	//ВидыНоменклатурыОтбор
	Элементы.ОтборПоВсемВидамНоменклатуры.Видимость = Не Объект.ВидНоменклатурыОтборИспользование;
	Элементы.ВидНоменклатурыОтборВидСравнения.Видимость = Объект.ВидНоменклатурыОтборИспользование;
	Элементы.ВидыНоменклатурыОтборЗначение.Видимость = Объект.ВидНоменклатурыОтборИспользование;

КонецПроцедуры

#Область ЗаполнитьДопКолонкиПоНоменклатуре

&НаСервере
Процедура ЗаполнитьДопКолонкиПоНоменклатуреВТабличныхЧастях()
	
	ЗаполнитьДопКолонкиПоНоменклатуре("Расчет");
	ЗаполнитьДопКолонкиПоНоменклатуре("Начисление");
	ЗаполнитьДопКолонкиПоНоменклатуре("Списание");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопКолонкиПоНоменклатуре(ИмяТЧ, СтрокаИД = Неопределено)
	
	ТЧ = Объект[ИмяТЧ];
	
	Если ЗначениеЗаполнено(СтрокаИД) Тогда
		
		СтрокаТЧ = ТЧ.НайтиПоИдентификатору(СтрокаИД);
		ПереченьНоменклатуры = Новый Массив;
		ПереченьНоменклатуры.Добавить(СтрокаТЧ.Номенклатура);
		
	Иначе
		
		ПереченьНоменклатуры = ТЧ.Выгрузить(,"Номенклатура");
		
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПереченьНоменклатуры", ПереченьНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Код КАК КодНоменклатуры,
	|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ПереченьНоменклатуры)";
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
		
	Если ЗначениеЗаполнено(СтрокаИД) Тогда //для отдельной строки ТЧ
		
		ЗаполнитьДопКолонкиПоНоменклатуреДляСтрокиТЧ(СтрокаТЧ, Выборка);		
		
	Иначе //для всех строк ТЧ
		
		Для каждого СтрокаТЧ Из ТЧ Цикл
			ЗаполнитьДопКолонкиПоНоменклатуреДляСтрокиТЧ(СтрокаТЧ, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопКолонкиПоНоменклатуреДляСтрокиТЧ(СтрокаТЧ, Выборка)
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда

		Выборка.Сбросить();
		Выборка.НайтиСледующий(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура));
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка); //КодНоменклатуры, ВидНоменклатуры, ЕдиницаИзмерения
			
	Иначе //пустая Номенклатура
		
		СтрокаТЧ.КодНоменклатуры = "";
		СтрокаТЧ.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
		СтрокаТЧ.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

#Область ВидыНоменклатурыОтбор

&НаСервере
Процедура СохранитьВидыНоменклатурыОтбор()
	
	//ВидыНоменклатурыОтборЗначение
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ВидыНоменклатурыОтборЗначение);
	Объект.ВидыНоменклатурыОтборЗначение = ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьВидыНоменклатурыОтбор()

	//ВидыНоменклатурыОтборЗначение
	Если ЗначениеЗаполнено(Объект.ВидыНоменклатурыОтборЗначение) Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Объект.ВидыНоменклатурыОтборЗначение);
		ВидыНоменклатурыОтборЗначение = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Иначе
		ВидыНоменклатурыОтборЗначение.Очистить();
	КонецЕсли;
	
	//ВидНоменклатурыОтборВидСравнения
	СписокВидовСравнения = Новый Массив;
	СписокВидовСравнения.Добавить(Строка(ВидСравнения.ВСписке));
	СписокВидовСравнения.Добавить(Строка(ВидСравнения.НеВСписке));
	
	Элементы.ВидНоменклатурыОтборВидСравнения.СписокВыбора.ЗагрузитьЗначения(СписокВидовСравнения);
	
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатурыОтборВидСравнения) Тогда
		Объект.ВидНоменклатурыОтборВидСравнения = Строка(ВидСравнения.ВСписке);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнить

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Расчет.Очистить();
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокВидовНоменклатуры", ВидыНоменклатурыОтборЗначение.ВыгрузитьЗначения());
	// НАЧАЛО Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	//Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
	Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ГраницаОстатков", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	// КОНЕЦ Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	Запрос.УстановитьПараметр("ДатаРанееНачисленныхОстатков", НачалоМесяца(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	|ПОМЕСТИТЬ вт_ВидыНоменклатурыОтбор
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ПометкаУдаления
	|	И &УсловиеОтбораПоВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыРасчета.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ПараметрыРасчета.КоличествоДней КАК КоличествоДней,
	// НАЧАЛО Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	//|	ДОБАВИТЬКДАТЕ(&ДатаДок, ДЕНЬ, -1 * ПараметрыРасчета.КоличествоДней) КАК НачалоПериодаАнализаНеликвидности,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаДок, ДЕНЬ, -1 * ПараметрыРасчета.КоличествоДней), ДЕНЬ) КАК НачалоПериодаАнализаНеликвидности,
	// КОНЕЦ Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	|	ПараметрыРасчета.ПроцентДляРезерва КАК ПроцентДляРезерва
	|ПОМЕСТИТЬ вт_ПараметрыРасчета
	|ИЗ
	|	РегистрСведений.тн_ПараметрыРасчетаРезерваПодОбесценениеТМЦ.СрезПоследних(
	|			&ДатаДок,
	|			ВидНоменклатуры В
	|				(ВЫБРАТЬ
	|					вт_ВидыНоменклатурыОтбор.ВидНоменклатуры КАК ВидНоменклатуры
	|				ИЗ
	|					вт_ВидыНоменклатурыОтбор)) КАК ПараметрыРасчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// НАЧАЛО Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	//|ВЫБРАТЬ
	//|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	//|	Себестоимость.КоличествоОстаток КАК КоличествоОстатковНаКонецПериода,
	//|	Себестоимость.СтоимостьРеглОстаток + Себестоимость.ДопРасходыРеглОстаток + Себестоимость.ТрудозатратыРеглОстаток + Себестоимость.ПостатейныеПостоянныеРеглОстаток + Себестоимость.ПостатейныеПеременныеРеглОстаток КАК СуммаОстатковНаКонецПериодаРегл,
	//|	Себестоимость.СтоимостьУпрОстаток + Себестоимость.ДопРасходыУпрОстаток + Себестоимость.ТрудозатратыУпрОстаток + Себестоимость.ПостатейныеПостоянныеУпрОстаток + Себестоимость.ПостатейныеПеременныеУпрОстаток КАК СуммаОстатковНаКонецПериодаУпр
	//|ПОМЕСТИТЬ вт_Остатки
	//|ИЗ
	//|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	//|			&ДатаДок,
	//|			Организация = &Организация
	//|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры В
	//|					(ВЫБРАТЬ
	//|						вт_ПараметрыРасчета.ВидНоменклатуры КАК ВидНоменклатуры
	//|					ИЗ
	//|						вт_ПараметрыРасчета)) КАК Себестоимость
	//|ГДЕ
	//|	Себестоимость.КоличествоОстаток > 0
	//|		ИЛИ Себестоимость.СтоимостьРеглОстаток + Себестоимость.ДопРасходыРеглОстаток + Себестоимость.ТрудозатратыРеглОстаток + Себестоимость.ПостатейныеПостоянныеРеглОстаток + Себестоимость.ПостатейныеПеременныеРеглОстаток > 0
	//|		ИЛИ Себестоимость.СтоимостьУпрОстаток + Себестоимость.ДопРасходыУпрОстаток + Себестоимость.ТрудозатратыУпрОстаток + Себестоимость.ПостатейныеПостоянныеУпрОстаток + Себестоимость.ПостатейныеПеременныеУпрОстаток > 0
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Номенклатура

	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(Себестоимость.КоличествоОстаток) КАК КоличествоОстатковНаКонецПериода,
	|	СУММА(Себестоимость.СтоимостьРеглОстаток + Себестоимость.ДопРасходыРеглОстаток + Себестоимость.ТрудозатратыРеглОстаток + Себестоимость.ПостатейныеПостоянныеРеглОстаток + Себестоимость.ПостатейныеПеременныеРеглОстаток) КАК СуммаОстатковНаКонецПериодаРегл,
	|	СУММА(Себестоимость.СтоимостьУпрОстаток + Себестоимость.ДопРасходыУпрОстаток + Себестоимость.ТрудозатратыУпрОстаток + Себестоимость.ПостатейныеПостоянныеУпрОстаток + Себестоимость.ПостатейныеПеременныеУпрОстаток) КАК СуммаОстатковНаКонецПериодаУпр
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаОстатков,
	|			Организация = &Организация
	|				И АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры В
	|					(ВЫБРАТЬ
	|						вт_ПараметрыРасчета.ВидНоменклатуры КАК ВидНоменклатуры
	|					ИЗ
	|						вт_ПараметрыРасчета)) КАК Себестоимость
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(Себестоимость.КоличествоОстаток) > 0
	|		ИЛИ СУММА(Себестоимость.СтоимостьРеглОстаток + Себестоимость.ДопРасходыРеглОстаток + Себестоимость.ТрудозатратыРеглОстаток + Себестоимость.ПостатейныеПостоянныеРеглОстаток + Себестоимость.ПостатейныеПеременныеРеглОстаток) > 0
	|		ИЛИ СУММА(Себестоимость.СтоимостьУпрОстаток + Себестоимость.ДопРасходыУпрОстаток + Себестоимость.ТрудозатратыУпрОстаток + Себестоимость.ПостатейныеПостоянныеУпрОстаток + Себестоимость.ПостатейныеПеременныеУпрОстаток) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	// КОНЕЦ Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Остатки.Номенклатура КАК Номенклатура,
	|	вт_Остатки.КоличествоОстатковНаКонецПериода КАК КоличествоОстатковНаКонецПериода,
	|	вт_Остатки.СуммаОстатковНаКонецПериодаРегл КАК СуммаОстатковНаКонецПериодаРегл,
	|	вт_Остатки.СуммаОстатковНаКонецПериодаУпр КАК СуммаОстатковНаКонецПериодаУпр,
	|	ОКР(ВЫБОР
	|			КОГДА вт_Остатки.КоличествоОстатковНаКонецПериода = 0
	|				ТОГДА 0
	|			ИНАЧЕ вт_Остатки.СуммаОстатковНаКонецПериодаРегл / вт_Остатки.КоличествоОстатковНаКонецПериода
	|		КОНЕЦ, 2) КАК СтоимостьЗаЕдиницуРегл,
	|	ОКР(ВЫБОР
	|			КОГДА вт_Остатки.КоличествоОстатковНаКонецПериода = 0
	|				ТОГДА 0
	|			ИНАЧЕ вт_Остатки.СуммаОстатковНаКонецПериодаУпр / вт_Остатки.КоличествоОстатковНаКонецПериода
	|		КОНЕЦ, 2) КАК СтоимостьЗаЕдиницуУпр
	|ПОМЕСТИТЬ вт_Цены
	|ИЗ
	|	вт_Остатки КАК вт_Остатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Закупки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА Закупки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ * Закупки.Количество) КАК КоличествоПриходЗаПериод
	|ПОМЕСТИТЬ вт_Приход
	|ИЗ
	|	вт_ПараметрыРасчета КАК вт_ПараметрыРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	|		ПО (Закупки.Организация = &Организация)
	// НАЧАЛО Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	//// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//|			И Закупки.Подразделение = &Подразделение
	//// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	// КОНЕЦ Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	|			И (Закупки.Период >= вт_ПараметрыРасчета.НачалоПериодаАнализаНеликвидности)
	|			И (Закупки.Период < &ДатаДок)
	|			И (Закупки.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры = вт_ПараметрыРасчета.ВидНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	Закупки.АналитикаУчетаНоменклатуры.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Выпуск.АналитикаУчетаНоменклатуры.Номенклатура,
	|	СУММА(Выпуск.Количество)
	|ИЗ
	|	вт_ПараметрыРасчета КАК вт_ПараметрыРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыпускПродукции КАК Выпуск
	|		ПО (Выпуск.Организация = &Организация)
	// НАЧАЛО Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	//// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//|			И Выпуск.Подразделение = &Подразделение
	//// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	// КОНЕЦ Борисенко Игорь 29.05.2025 Выполнение задач №000053852
	|			И (Выпуск.Период >= вт_ПараметрыРасчета.НачалоПериодаАнализаНеликвидности)
	|			И (Выпуск.Период < &ДатаДок)
	|			И (Выпуск.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры = вт_ПараметрыРасчета.ВидНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	Выпуск.АналитикаУчетаНоменклатуры.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура,
	|	СУММА(Себестоимость.Количество)
	|ИЗ
	|	вт_ПараметрыРасчета КАК вт_ПараметрыРасчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|		ПО (Себестоимость.Организация = &Организация)
	|			И (Себестоимость.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазборкаТоваров), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеТоваров)))
	|			И (Себестоимость.Период >= вт_ПараметрыРасчета.НачалоПериодаАнализаНеликвидности)
	|			И (Себестоимость.Период < &ДатаДок)
	|			И (Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура.ВидНоменклатуры = вт_ПараметрыРасчета.ВидНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	Себестоимость.АналитикаУчетаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура КАК Номенклатура,
	|	СУММА(Остатки.КоличествоОстатковНаКонецПериода) КАК КоличествоОстатковНаКонецПериода,
	|	СУММА(0) КАК КоличествоПриходЗаПериод
	|ПОМЕСТИТЬ вт_ОстаткиПриход
	|ИЗ
	|	вт_Остатки КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Приход.Номенклатура,
	|	СУММА(0),
	|	СУММА(Приход.КоличествоПриходЗаПериод)
	|ИЗ
	|	вт_Приход КАК Приход
	|
	|СГРУППИРОВАТЬ ПО
	|	Приход.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ОстаткиПриход.Номенклатура КАК Номенклатура,
	|	СУММА(вт_ОстаткиПриход.КоличествоОстатковНаКонецПериода - вт_ОстаткиПриход.КоличествоПриходЗаПериод) КАК ОборачиваемостьПоКоличеству,
	|	ВЫБОР
	|		КОГДА СУММА(вт_ОстаткиПриход.КоличествоОстатковНаКонецПериода - вт_ОстаткиПриход.КоличествоПриходЗаПериод) > 0
	|			ТОГДА СУММА(вт_ОстаткиПриход.КоличествоОстатковНаКонецПериода - вт_ОстаткиПриход.КоличествоПриходЗаПериод)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоРезерваКНачислению
	|ПОМЕСТИТЬ вт_Оборачиваемость
	|ИЗ
	|	вт_ОстаткиПриход КАК вт_ОстаткиПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ОстаткиПриход.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Оборачиваемость.Номенклатура КАК Номенклатура,
	|	СУММА(вт_Оборачиваемость.КоличествоРезерваКНачислению) КАК КоличествоРезерваКНачислению,
	|	СУММА(вт_Оборачиваемость.КоличествоРезерваКНачислению * ЕСТЬNULL(вт_Цены.СтоимостьЗаЕдиницуРегл, 0) * ЕСТЬNULL(вт_ПараметрыРасчета.ПроцентДляРезерва, 0) / 100) КАК СуммаРанееНачисленногоРезерваРегл,
	|	СУММА(вт_Оборачиваемость.КоличествоРезерваКНачислению * ЕСТЬNULL(вт_Цены.СтоимостьЗаЕдиницуУпр, 0) * ЕСТЬNULL(вт_ПараметрыРасчета.ПроцентДляРезерва, 0) / 100) КАК СуммаРанееНачисленногоРезерваУпр
	|ПОМЕСТИТЬ вт_КНачислению
	|ИЗ
	|	вт_Оборачиваемость КАК вт_Оборачиваемость
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Цены КАК вт_Цены
	|		ПО вт_Оборачиваемость.Номенклатура = вт_Цены.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ПараметрыРасчета КАК вт_ПараметрыРасчета
	|		ПО вт_Оборачиваемость.Номенклатура.ВидНоменклатуры = вт_ПараметрыРасчета.ВидНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Оборачиваемость.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//|ВЫБРАТЬ
	//|	Резервы.Номенклатура КАК Номенклатура,
	//|	Резервы.КоличествоОстаток КАК КоличествоРанееНачисленногоРезерва,
	//|	Резервы.СуммаРезерваРеглОстаток КАК СуммаРанееНачисленногоРезерваРегл,
	//|	Резервы.СуммаРезерваУпрОстаток КАК СуммаРанееНачисленногоРезерваУпр
	//|ПОМЕСТИТЬ вт_РанееНачислен
	//|ИЗ
	//|	РегистрНакопления.тн_РезервыПодОбесценениеТМЦ.Остатки(
	//|			&ДатаРанееНачисленныхОстатков,
	//|			ВидНоменклатуры В
	//|				(ВЫБРАТЬ
	//|					вт_ПараметрыРасчета.ВидНоменклатуры КАК ВидНоменклатуры
	//|				ИЗ
	//|					вт_ПараметрыРасчета)) КАК Резервы
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	|ВЫБРАТЬ
	|	вт_Цены.Номенклатура КАК Номенклатура,
	|	вт_Цены.КоличествоОстатковНаКонецПериода КАК КоличествоОстатковНаКонецПериода,
	|	вт_Цены.СуммаОстатковНаКонецПериодаРегл КАК СуммаОстатковНаКонецПериодаРегл,
	|	вт_Цены.СуммаОстатковНаКонецПериодаУпр КАК СуммаОстатковНаКонецПериодаУпр,
	|	вт_Цены.СтоимостьЗаЕдиницуРегл КАК СтоимостьЗаЕдиницуРегл,
	|	вт_Цены.СтоимостьЗаЕдиницуУпр КАК СтоимостьЗаЕдиницуУпр,
	|	0 КАК КоличествоПриходЗаПериод,
	|	0 КАК ОборачиваемостьПоКоличеству,
	|	0 КАК КоличествоРезерваКНачислению,
	|	0 КАК СуммаРезерваКНачислениюРегл,
	|	0 КАК СуммаРезерваКНачислениюУпр,
	|	0 КАК КоличествоРанееНачисленногоРезерва,
	|	0 КАК СуммаРанееНачисленногоРезерваРегл,
	|	0 КАК СуммаРанееНачисленногоРезерваУпр
	|ПОМЕСТИТЬ вт_Свод
	|ИЗ
	|	вт_Цены КАК вт_Цены
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_Приход.Номенклатура,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	вт_Приход.КоличествоПриходЗаПериод,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	вт_Приход КАК вт_Приход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_Оборачиваемость.Номенклатура,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	вт_Оборачиваемость.ОборачиваемостьПоКоличеству,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	вт_Оборачиваемость КАК вт_Оборачиваемость
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_КНачислению.Номенклатура,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	вт_КНачислению.КоличествоРезерваКНачислению,
	|	вт_КНачислению.СуммаРанееНачисленногоРезерваРегл,
	|	вт_КНачислению.СуммаРанееНачисленногоРезерваУпр,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	вт_КНачислению КАК вт_КНачислению
	|
	// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	вт_РанееНачислен.Номенклатура,
	//|	0,
	//|	0,
	//|	0,
	//|	0,
	//|	0,
	//|	0,
	//|	0,
	//|	0,
	//|	0,
	//|	0,
	//|	вт_РанееНачислен.КоличествоРанееНачисленногоРезерва,
	//|	вт_РанееНачислен.СуммаРанееНачисленногоРезерваРегл,
	//|	вт_РанееНачислен.СуммаРанееНачисленногоРезерваУпр
	//|ИЗ
	//|	вт_РанееНачислен КАК вт_РанееНачислен
	// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Свод.Номенклатура КАК Номенклатура,
	|	&Подразделение КАК Подразделение,
	|	вт_ПараметрыРасчета.НачалоПериодаАнализаНеликвидности КАК НачалоПериодаАнализаНеликвидности,
	|	СУММА(вт_Свод.КоличествоОстатковНаКонецПериода) КАК КоличествоОстатковНаКонецПериода,
	|	СУММА(вт_Свод.СуммаОстатковНаКонецПериодаРегл) КАК СуммаОстатковНаКонецПериодаРегл,
	|	СУММА(вт_Свод.СуммаОстатковНаКонецПериодаУпр) КАК СуммаОстатковНаКонецПериодаУпр,
	|	МАКСИМУМ(вт_Свод.СтоимостьЗаЕдиницуРегл) КАК СтоимостьЗаЕдиницуРегл,
	|	МАКСИМУМ(вт_Свод.СтоимостьЗаЕдиницуУпр) КАК СтоимостьЗаЕдиницуУпр,
	|	СУММА(вт_Свод.КоличествоПриходЗаПериод) КАК КоличествоПриходЗаПериод,
	|	МАКСИМУМ(вт_Свод.ОборачиваемостьПоКоличеству) КАК ОборачиваемостьПоКоличеству,
	|	СУММА(вт_Свод.КоличествоРезерваКНачислению) КАК КоличествоРезерваКНачислению,
	|	СУММА(вт_Свод.СуммаРезерваКНачислениюРегл) КАК СуммаРезерваКНачислениюРегл,
	|	СУММА(вт_Свод.СуммаРезерваКНачислениюУпр) КАК СуммаРезерваКНачислениюУпр,
	// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//|	СУММА(вт_Свод.КоличествоРанееНачисленногоРезерва) КАК КоличествоРанееНачисленногоРезерва,
	//|	СУММА(вт_Свод.СуммаРанееНачисленногоРезерваРегл) КАК СуммаРанееНачисленногоРезерваРегл,
	//|	СУММА(вт_Свод.СуммаРанееНачисленногоРезерваУпр) КАК СуммаРанееНачисленногоРезерваУпр
	|	0 КАК КоличествоРанееНачисленногоРезерва,
	|	0 КАК СуммаРанееНачисленногоРезерваРегл,
	|	0 КАК СуммаРанееНачисленногоРезерваУпр
	// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	|ИЗ
	|	вт_Свод КАК вт_Свод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_ПараметрыРасчета КАК вт_ПараметрыРасчета
	|		ПО вт_Свод.Номенклатура.ВидНоменклатуры = вт_ПараметрыРасчета.ВидНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Свод.Номенклатура,
	|	вт_ПараметрыРасчета.НачалоПериодаАнализаНеликвидности";
	
	//УсловиеОтбораПоВидНоменклатуры
	Если Объект.ВидНоменклатурыОтборИспользование = Истина Тогда
		
		Если Объект.ВидНоменклатурыОтборВидСравнения = Строка(ВидСравнения.ВСписке) Тогда 
			УсловиеОтбораПоВидНоменклатуры = "ВидыНоменклатуры.Ссылка В (&СписокВидовНоменклатуры)";
		Иначе //НеВСписке
			УсловиеОтбораПоВидНоменклатуры = "НЕ ВидыНоменклатуры.Ссылка В (&СписокВидовНоменклатуры)";
		КонецЕсли;
		
	Иначе //отбор по ВидамНоменклатуры не используется
		УсловиеОтбораПоВидНоменклатуры = "ИСТИНА";
		
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоВидНоменклатуры", УсловиеОтбораПоВидНоменклатуры);
	
	УстановитьПривилегированныйРежим(Истина);
	тзРасчет = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);

	//тч Расчет
	Объект.Расчет.Загрузить(тзРасчет); 
	
	// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	////тч Начисление
	//ПеренестиНачисленияИзРасчета();
	//
	////тч Списание
	//ПеренестиСписанияИзРасчета();
	// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111

	ЗаполнитьДопКолонкиПоНоменклатуреВТабличныхЧастях();
	
КонецПроцедуры

&НаКлиенте
Процедура Ответ_ЗагрузитьИзExcel(Ответ, ДопПараметры) Экспорт
	
	Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("АдресВоВременномХранилище") Тогда
		ПеренестиДанныеФайлаВДокумент(Ответ.АдресВоВременномХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиДанныеФайлаВДокумент(АдресВоВременномХранилище)
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ТипЗнч(ДанныеФайла) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Расчет.Очистить();
	
	Для каждого СтрокаТЗ Из ДанныеФайла Цикл
		
		СтрокаТЧ = Объект.Расчет.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
		
	КонецЦикла;

	// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//ЗаполнитьСписанияВРасчете();
	//
	////тч Начисление
	//ПеренестиНачисленияИзРасчета();
	//
	////тч Списание
	//ПеренестиСписанияИзРасчета();
	// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111

	ЗаполнитьДопКолонкиПоНоменклатуреВТабличныхЧастях();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписанияВРасчете()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаРанееНачисленныхОстатков", НачалоМесяца(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("ТЧ", Объект.Расчет.Выгрузить(,"Номенклатура"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	&Подразделение КАК Подразделение
	|ПОМЕСТИТЬ вт_Расчет
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Расчет.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	вт_Расчет.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ вт_Отбор
	|ИЗ
	|	вт_Расчет КАК вт_Расчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО вт_Расчет.Номенклатура = СпрНоменклатура.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Резервы.Номенклатура КАК Номенклатура,
	|	Резервы.КоличествоОстаток КАК КоличествоРанееНачисленногоРезерва,
	|	Резервы.СуммаРезерваРеглОстаток КАК СуммаРанееНачисленногоРезерваРегл,
	|	Резервы.СуммаРезерваУпрОстаток КАК СуммаРанееНачисленногоРезерваУпр
	|ИЗ
	|	РегистрНакопления.тн_РезервыПодОбесценениеТМЦ.Остатки(
	|			&ДатаРанееНачисленныхОстатков,
	|			(Номенклатура, ВидНоменклатуры, Подразделение) В
	|				(ВЫБРАТЬ
	|					вт_Отбор.Номенклатура КАК Номенклатура,
	|					вт_Отбор.ВидНоменклатуры,
	|					вт_Отбор.Подразделение КАК ВидНоменклатуры
	|				ИЗ
	|					вт_Отбор)) КАК Резервы";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Поиск = Новый Структура("Номенклатура");
	
	Для каждого СтрокаТЧ Из Объект.Расчет Цикл
		
		Поиск.Номенклатура = СтрокаТЧ.Номенклатура;
		Выборка.Сбросить();
		// НАЧАЛО Борисенко Игорь 19.03.2025 Выполнение задач №000053091
		//Если Выборка.Следующий() Тогда
		Если Выборка.НайтиСледующий(Поиск) Тогда
		// КОНЕЦ Борисенко Игорь 19.03.2025 Выполнение задач №000053091
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиНачисленияИзРасчета()
	
	Объект.Начисление.Очистить();
	
	// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//тзНачисление = Объект.Расчет.Выгрузить(,"Номенклатура, КоличествоРезерваКНачислению, СуммаРезерваКНачислениюРегл, СуммаРезерваКНачислениюУпр");
	//тзНачисление.Свернуть("Номенклатура", "КоличествоРезерваКНачислению, СуммаРезерваКНачислениюРегл, СуммаРезерваКНачислениюУпр");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Расчет", Объект.Расчет.Выгрузить(,"Номенклатура, КоличествоРезерваКНачислению, СуммаРезерваКНачислениюРегл, СуммаРезерваКНачислениюУпр"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расчет.Номенклатура КАК Номенклатура,
	|	Расчет.КоличествоРезерваКНачислению КАК КоличествоРезерваКНачислению,
	|	Расчет.СуммаРезерваКНачислениюРегл КАК СуммаРезерваКНачислениюРегл,
	|	Расчет.СуммаРезерваКНачислениюУпр КАК СуммаРезерваКНачислениюУпр
	|ПОМЕСТИТЬ втРасчет
	|ИЗ
	|	&Расчет КАК Расчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасчет.Номенклатура КАК Номенклатура,
	|	СУММА(втРасчет.КоличествоРезерваКНачислению) КАК КоличествоРезерваКНачислению,
	|	СУММА(втРасчет.СуммаРезерваКНачислениюРегл) КАК СуммаРезерваКНачислениюРегл,
	|	СУММА(втРасчет.СуммаРезерваКНачислениюУпр) КАК СуммаРезерваКНачислениюУпр
	|ИЗ
	|	втРасчет КАК втРасчет
	|ГДЕ
	|	(втРасчет.КоличествоРезерваКНачислению <> 0
	|			ИЛИ втРасчет.СуммаРезерваКНачислениюРегл <> 0
	|			ИЛИ втРасчет.СуммаРезерваКНачислениюУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	втРасчет.Номенклатура";
	тзНачисление = Запрос.Выполнить().Выгрузить();
	
	// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	Объект.Начисление.Загрузить(тзНачисление);
	
КонецПроцедуры	

&НаСервере
Процедура ПеренестиСписанияИзРасчета()

	Объект.Списание.Очистить();
	
	// НАЧАЛО Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	//тзСписание = Объект.Расчет.Выгрузить(,"Номенклатура, КоличествоРанееНачисленногоРезерва, СуммаРанееНачисленногоРезерваРегл, СуммаРанееНачисленногоРезерваУпр");
	//тзСписание.Свернуть("Номенклатура", "КоличествоРанееНачисленногоРезерва, СуммаРанееНачисленногоРезерваРегл, СуммаРанееНачисленногоРезерваУпр");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Расчет", Объект.Расчет.Выгрузить(,"Номенклатура, КоличествоРанееНачисленногоРезерва, СуммаРанееНачисленногоРезерваРегл, СуммаРанееНачисленногоРезерваУпр"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расчет.Номенклатура КАК Номенклатура,
	|	Расчет.КоличествоРанееНачисленногоРезерва КАК КоличествоРанееНачисленногоРезерва,
	|	Расчет.СуммаРанееНачисленногоРезерваРегл КАК СуммаРанееНачисленногоРезерваРегл,
	|	Расчет.СуммаРанееНачисленногоРезерваУпр КАК СуммаРанееНачисленногоРезерваУпр
	|ПОМЕСТИТЬ втРасчет
	|ИЗ
	|	&Расчет КАК Расчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасчет.Номенклатура КАК Номенклатура,
	|	СУММА(втРасчет.КоличествоРанееНачисленногоРезерва) КАК КоличествоРанееНачисленногоРезерва,
	|	СУММА(втРасчет.СуммаРанееНачисленногоРезерваРегл) КАК СуммаРанееНачисленногоРезерваРегл,
	|	СУММА(втРасчет.СуммаРанееНачисленногоРезерваУпр) КАК СуммаРанееНачисленногоРезерваУпр
	|ИЗ
	|	втРасчет КАК втРасчет
	|ГДЕ
	|	(втРасчет.КоличествоРанееНачисленногоРезерва <> 0
	|			ИЛИ втРасчет.СуммаРанееНачисленногоРезерваРегл <> 0
	|			ИЛИ втРасчет.СуммаРанееНачисленногоРезерваУпр <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	втРасчет.Номенклатура";
	тзСписание = Запрос.Выполнить().Выгрузить();
	
	// КОНЕЦ Борисенко Игорь 20.03.2025 Выполнение задач №000053111
	Объект.Списание.Загрузить(тзСписание);
	
КонецПроцедуры	
	
#КонецОбласти

// Борисенко Игорь 20.03.2025 Выполнение задач №000053111
&НаСервере
Процедура ЗаполнитьРанееНачисленныеРезервыСервер()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокВидовНоменклатуры", ВидыНоменклатурыОтборЗначение.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ДатаРанееНачисленныхОстатков", НачалоМесяца(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры
	|ПОМЕСТИТЬ вт_ВидыНоменклатурыОтбор
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ПометкаУдаления
	|	И &УсловиеОтбораПоВидНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Резервы.Номенклатура КАК Номенклатура,
	|	Резервы.КоличествоОстаток КАК КоличествоРанееНачисленногоРезерва,
	|	Резервы.СуммаРезерваРеглОстаток КАК СуммаРанееНачисленногоРезерваРегл,
	|	Резервы.СуммаРезерваУпрОстаток КАК СуммаРанееНачисленногоРезерваУпр
	|ИЗ
	|	РегистрНакопления.тн_РезервыПодОбесценениеТМЦ.Остатки(
	|			&ДатаРанееНачисленныхОстатков,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|				И ВидНоменклатуры В
	|					(ВЫБРАТЬ
	|						вт_ВидыНоменклатурыОтбор.ВидНоменклатуры КАК ВидНоменклатуры
	|					ИЗ
	|						вт_ВидыНоменклатурыОтбор)) КАК Резервы";
	
	//УсловиеОтбораПоВидНоменклатуры
	Если Объект.ВидНоменклатурыОтборИспользование = Истина Тогда
		
		Если Объект.ВидНоменклатурыОтборВидСравнения = Строка(ВидСравнения.ВСписке) Тогда 
			УсловиеОтбораПоВидНоменклатуры = "ВидыНоменклатуры.Ссылка В (&СписокВидовНоменклатуры)";
		Иначе //НеВСписке
			УсловиеОтбораПоВидНоменклатуры = "НЕ ВидыНоменклатуры.Ссылка В (&СписокВидовНоменклатуры)";
		КонецЕсли;
		
	Иначе //отбор по ВидамНоменклатуры не используется
		УсловиеОтбораПоВидНоменклатуры = "ИСТИНА";
		
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораПоВидНоменклатуры", УсловиеОтбораПоВидНоменклатуры);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);

	//тч Расчет
	Поиск = Новый Структура("Номенклатура");
	Пока Выборка.Следующий() Цикл
		
		Поиск.Номенклатура = Выборка.Номенклатура;
		СтрокиРасчет = Объект.Расчет.НайтиСтроки(Поиск);
		Если СтрокиРасчет.Количество() = 0 Тогда
			СтрокаРасчет = Объект.Расчет.Добавить();
		Иначе
			СтрокаРасчет = СтрокиРасчет[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаРасчет, Выборка); //Номенклатура, КоличествоРанееНачисленногоРезерва, СуммаРанееНачисленногоРезерваРегл, СуммаРанееНачисленногоРезерваУпр
		
	КонецЦикла;

	ЗаполнитьДопКолонкиПоНоменклатуреВТабличныхЧастях();

КонецПроцедуры

#КонецОбласти
